package com.hit.curricelumdesign.context.enums;

/**
 * Description: 响应结果
 * 				错误编码说明：错误编码共六位，前两位表示错误级别，中间两位为模块，后两位为错误错误编码
 * 				错误级别：10:系统级别，20：服务级别  30:业务级别
 *
 * ClassName: Result
 * date: 2018年11月11日
 *
 * @author YGC
 * @version
 * @since JDK 1.8
 */
public enum Error {

	//----------------------------------------成功
	SUCCESS("0", "success"),

	//----------------------------------------系统
	_06410001("06410001", "系统错误！"),
	_06410002("06410002", "未知类型错误！"),
	_06410003("06410003", "资源未找到！"),
	_06410004("06410004", "参数校验失败！"),
	_06410005("06410005", "非法请求！"),
	_06410006("06410006", "权限校验失败！"),

	//----------------------------------------查询模块
	_064200001("064200001", "查询数据失败！"),
	_064200002("064200002", "查询数据无结果！"),
	_064200003("064200003", "统计数据失败！"),
	_064200004("064200004", "统计数据无结果！"),
	_064200005("064200005", "没有权限！"),
	_064200006("064200006", "SQL语句错误！"),

	//----------------------------------------维护模块
	_064200101("064200101", "参数为空！"),
	_064200102("064200102", "参数长度超长，最大:"),
	_064200103("064200103", "查询无结果！"),
	_064200104("064200104", "更新失败！"),
	_064200105("064200105", "删除失败！"),
	_064200106("064200106", "请输入数字！"),
	_064200107("064200107", "不能小于1！"),
	_064200108("064200108", "不能大于100！"),
	_064200109("064200109", "操作成功！"),
	_064200110("064200110", "操作失败！"),
	_064200111("064200111", "添加失败！"),
	_064200112("064200112", "上传失败！"),
	_064200113("064200113", "请选择图片！"),
	_064200114("064200114", "上传图片最大为5M！"),
	_064200115("064200115", "服务调用失败！"),

	//----------------------------------------系统设置模块

	;



	/**
	 * 错误编码
	 */
	private String errorCode;

	/**
	 * 错误信息
	 */
	private String errorMsg;

	private Error(String errorCode, String errorMsg) {
		this.errorCode = errorCode;
		this.errorMsg = errorMsg;
	}

	public String getErrorCode() {
		return errorCode;
	}

	public static String code(String name){
		return Error.valueOf(name).errorCode;
	}


	public String getErrorMsg() {
		return errorMsg;
	}

	public static String msg(String name){
		return Error.valueOf(name).errorMsg;
	}

}
